*One Hot Encoding is applicable for Nominal data(no order)*

*In OneHotEncoding, if there are n categories (n-1) columns are created and most probably dropping the first one*

*we don't use pandas for one hot encoding, instead we use scikitlearn*

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('../files/cars.csv')

In [3]:
data.head()

     brand  km_driven    fuel         owner  selling_price
0   Maruti     145500  Diesel   First Owner         450000
1    Skoda     120000  Diesel  Second Owner         370000
2    Honda     140000  Petrol   Third Owner         158000
3  Hyundai     127000  Diesel   First Owner         225000
4   Maruti     120000  Petrol   First Owner         130000

In [4]:
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import OneHotEncoder

In [5]:
X_train, X_test, y_train, y_test = train_test_split(
    data.iloc[:, 0:4],
    data.iloc[:, -1],
    test_size=0.2,
    random_state=15,
)

In [6]:
X_train.head()

         brand  km_driven    fuel         owner
776      Skoda      60000  Petrol  Second Owner
7843  Mahindra       6000  Petrol   First Owner
6700    Toyota      25538  Petrol   First Owner
3702      Ford      90000  Petrol   First Owner
3635   Hyundai      50000  Petrol   First Owner

In [8]:
ohe = OneHotEncoder(drop= 'first', sparse_output= False, dtype= np.int32)

In [9]:
X_train_new = ohe.fit_transform(X_train[["fuel", "owner"]]) # if sparse is False

# if sparse_output is true 
# X_train_new = ohe.fit_transform(X_train[["fuel", "owner"]]).toarray()

In [10]:
X_test_new = ohe.fit_transform(X_test[["fuel", "owner"]])

*horizontally stacking an numpy array*

In [12]:
np.hstack((X_train[['brand', 'km_driven']].values, X_train_new))

array([['Skoda', 60000, 0, ..., 1, 0, 0],
       ['Mahindra', 6000, 0, ..., 0, 0, 0],
       ['Toyota', 25538, 0, ..., 0, 0, 0],
       ...,
       ['Maruti', 50000, 0, ..., 0, 0, 1],
       ['Maruti', 188000, 0, ..., 0, 0, 0],
       ['Tata', 80000, 0, ..., 0, 0, 0]], shape=(6502, 9), dtype=object)

*OneHotEncoding of Categories*

In [23]:
counts = data['brand'].value_counts()

In [17]:
data['brand'].nunique()
threshold = 90

In [26]:
repl = counts[counts <= threshold].index
repl

Index(['Nissan', 'Jaguar', 'Volvo', 'Datsun', 'Mercedes-Benz', 'Fiat', 'Audi',
       'Lexus', 'Jeep', 'Mitsubishi', 'Land', 'Force', 'Isuzu', 'Ambassador',
       'Kia', 'MG', 'Daewoo', 'Ashok', 'Opel', 'Peugeot'],
      dtype='object', name='brand')

In [20]:
pd.get_dummies(data['brand'].replace(repl, 'others')).astype(int)

,BMW,Chevrolet,Ford,Honda,Hyundai,Mahindra,Maruti,Renault,Skoda,Tata,Toyota,Volkswagen,others
0,0,0,0,0,0,0,1,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,1,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,1,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
8123,0,0,0,0,1,0,0,0,0,0,0,0,0
8124,0,0,0,0,1,0,0,0,0,0,0,0,0
8125,0,0,0,0,0,0,1,0,0,0,0,0,0
8126,0,0,0,0,0,0,0,0,0,1,0,0,0
8127,0,0,0,0,0,0,0,0,0,1,0,0,0